{
  "discordInviteLink": "https://discord.gg/kq39yhT4rX",
  "moddersteam": [
    {
      "modder_username": "Coding_Dynasty",
      "modder_description": "Main modder",
      "modder_img": "https://avatars.githubusercontent.com/u/40118124",
      "isTitled": true,
      "isMainModder": true,
      "isActive": true,
      "title": "Main modders"
    }
  ],
  "changelog": [
    {
      "title": "Sketchware Pro v6.4.0 test build 05",
      "description": "We've made a few changes to the Logic Editor. Please make sure to make a backup of your entire .sketchware folder before you try this beta out! There might be bugs in the editor, and they could corrupt your projects. Please check in the Issues section (https://github.com/Sketchware-Pro/Sketchware-Pro/issues) before you report any.\n\nHighlighted features\n - Java 1.9, 10, and 11 compile support! This only works in minApi26 builds though. Thanks to @PranavPurwar for the contribution!\n - Syntax highlighting for Kotlin and even XML files.\n - When Sketchware Pro crashes, you can now send the error message to us. It's fully optional though, so please make sure to send them if you want to help us fix bugs!\n - New features using root access: Auto-installing of projects, and also launching of projects if auto-install is enabled and worked.\n - You can now use e.g. `tools:replace=\\\"android:id\\\"` in a View's inject property to remove `android:id` from its XML code. This is a replacement for XML Command Blocks that change tiny things like these.\n\nOther new features/improvements\n - New instructions on setting a custom return type when creating a new More Block.\n - Kotlinc updated to v1.7.10\n - Improved confirmation dialog when about to delete all attributes of an Activity in AndroidManifest Manager.\n - Upgrades to r8 v3.3.75.\n - When using the force darken apps Developer setting, the Layout Editor preview won't be darkened too, as it changes how the app really looks.\n - Icons available in the Import Icon activity now get extracted to the cache dir, not /Internal storage/.sketchware/…. This improves performance on Android 11+ devices, and allows easily freeing up space taken by those temporary files.\n - The FAB in the About Sketchware Pro screen got updated to match Discord's new style.\n - More build progress when exporting a project.\n - Kotlin files in Java/Kotlin Manager now have an icon.\n - Projects can now be exported and then signed using testkey.\n - An easy way to restore defaults on corrupted parts, such as Custom Blocks. It works by just renaming the broken file. This currently works for Custom Repositories in Local library Downloader, Custom Blocks and Palettes in Block Manager, and Block Selector Menu Manager.\n - Injections made in AppCompat Injection Manager are now cached to improve performance.\n - The default android.jar was upgraded to SDK version 33, r02\n - The version name in Program information is now selectable.\n - Update to bundletool v1.11.3\n - Update to sora-editor v0.17.2\n - Update of the built-in material library for projects to v1.6.1\n - Update of Firebase Database to v19.3.1\n\nFixes\n - Projects using e.g. the Google Maps library work again.\n - Projects don't crash anymore due to SketchLogger if debug logging is enabled.\n - Sometimes even in release builds debug logs were enabled. That has been fixed.\n - Adding new AdMob ad unit IDs works again.\n - In the About Sketchware Pro screen only the latest version in Changelog is marked blue, like it always should have been.\n - FragmentAdapter Components can be used in Fragment Activities too now.\n - Having a very large compile error won't crash the app anymore. This is a bug even present in v6.3.0 fix1.\n - Switching apps while generating a source preview of a file in DesignActivity won't crash the app anymore.\n - Some ProGuard classpath errors were fixed.\n - The known ProGuard bug from v6.4.0-rc04 was fixed.\n - The AndroidManifest.xml preview in AndroidManifest Manager contained XML Command Blocks applied more than once sometimes. Fixed now.\n - Some fixes to projects exported to Android Studio.\n - Exporting an AAB won't fail with a StackOverflowException anymore.\n - Activities which already have `android:exported` set by injections in AndroidManifest Manager won't get duplicate `android:export` properties when targeting SDK version 31 and higher anymore.\n - Using 1+ Dynamic Link Components and targeting SDK version 31 and higher won't add a duplicate property to AndroidManifest.xml anymore.\n -\n - Custom Components can share names with built-in types and get its imports too, back to how it used to be in v6.3.0 fix1 and earlier.\n - Fixes picking a Font sometimes corrupting it, and making the Font unusable in the app.\n - Picking a Sound in Sound Manager won't crash on some Android versions anymore. This is a bug even present in vanilla Sketchware.\n - The Import AdMob details from another project Button works now. This is also a vanilla Sketchware bug.\n - When a Font can't be previewed in the Logic Editor, the app won't crash now. This is another vanilla Sketchware bug.\n - The app won't crash on null Custom Events and Components anymore.\n - Component descriptions can be changed using strings.xml again. This is a regression even in v6.3.0 fix1.\n - Some Custom Block Palette color parsing fixes in Block Manager.\n - Importing Custom Blocks into a Palette works again.\n - Hopefully a fix for some files being compressed in AABs even though they shouldn't be, for example sounds.\n - The default project backup filename format now contains two-digit months all the time.\n - Local library Downloader extracts android.jar if needed automatically, without failing without telling why exactly.\n - After creating a new Custom Listener, you don't have to restart the app anymore for it to be recognized by Sketchware Pro.\n - Disabling a Local library for a project should work in all cases now.\n - The file /Internal storage/.sketchware/data/system/local_library won't be created anymore if opening Local library Manager from Developer Tools.\n - Having e.g. `@color/white` as border color in a CircleImageView won't show up the false-positive invalid background color toast anymore. If the color really is invalid though, the app will also tell the CircleImageView's ID. A typo in the error message was also fixed.\n - The orientation and weightSum property were not are applied in XML to RadioGroups and other Views, even though they were shown in the Properties of the View. This is a bug present even in v6.3.0 fix1, but has now been fixed.\n - The Logcat Reader button in Developer Tools now actually works.\n - SketchApplication.java is not generated anymore if a custom application class is in use.\n - SketchLogger.java automatically tries to use the custom application class now. The class needs a static method `getContext()` returning `android.content.Context` to work though.\n - ProGuard should work on API levels < 24 again.\n - Trying to get data from Firebase Database with ProGuard enabled didn't work out-of-the-box, it crashed at runtime. Now it works, by adding ProGuard rules to built-in library Gson.\n - Importing a More Block with a custom return type from Collections won't break its return type anymore. Checking for duplicated names was fixed too.\n - Spaces in More Block names are disallowed again, as they cannot be compiled.\n\nFull Changelog: https://github.com/Sketchware-Pro/Sketchware-Pro/compare/v6.4.0-rc04...v6.4.0-rc05",
      "releaseDate": 1667602800000,
      "isBeta": true,
      "isTitled": true
    }
  ]
}
